bool isWhite(int index){
  int y = index % 8;  // محاسبه شماره ستون براساس شماره عنصر
  int x = index ~/ 8;  // محاسبه شماره ردیف براساس شماره عنصر
  // عملگر ~/ برای تقسیم دو عدد به صورتی استفاده می‌شود که فقط بخش صحیح نتیجه تقسیم باقی می‌ماند و اعشار حذف می‌شود.
  bool isWhite = (x + y) % 2 == 0;// تشخیص رنگ مربع بر اساس موقعیت ستون و ردیف
  return isWhite;
}

// چک میکنه ایا تو اون خونه مهره ای وجود داره یا نه
bool isInBoard(int row,int col){return row >= 0 && row < 8 && col >= 0 && col < 8;}